// *? Напишіть код, який запитуватиме
// *? логін за допомогою prompt та логувати результат
// *? у консоль браузера

// *? Якщо відвідувач вводить "Адмін",
// *? то prompt запитує пароль.
// *? Якщо нічого не ввели або натиснуто клавішу Esc
// *? вивести рядок "Скасовано"
// *? В іншому випадку вивести рядок "Я вас не знаю"

// *? Пароль перевіряти так:
// *? Якщо введено пароль "Я головний",
// *? то вивести рядок "Здрастуйте!"
// *? інакше виводити рядок "Невірний пароль!"

const admin = prompt('Введіть логін');

if (admin === 'Адмін') {
  const password = prompt('Введіть пароль');
  if (password) {
    if (password === 'Я головний') {
      alert('Здрастуйте!');
    } else {
      alert('Невірний пароль!');
    }
  } else {
    alert('Скасовано');
  }
} else {
  alert('Я вас не знаю!');
}

console.log(admin);
